Revit 2027 API
WireConduitTypeSet.Clear Method
Removes every conduit type from the set, rendering it empty.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
public:
virtual void Clear()
abstract Clear : unit -> unit
override Clear : unit -> unit
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace